keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_OFF (18)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG43 */
#define IFX_DSADC_ACCPROT_RG43_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG43 */
#define IFX_DSADC_ACCPROT_RG43_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG43 */
#define IFX_DSADC_ACCPROT_RG43_OFF (19)

/** \\brief  Length for Ifx_DSADC_ACCPROT_Bits.RG44 */
#define IFX_DSADC_ACCPROT_RG44_LEN (1)

/** \\brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG44 */
#define IFX_DSADC_ACCPROT_RG44_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG44 */
#define IFX_DSADC_ACCPROT_RG44_OFF (20)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_LEN (5)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_MSK (0x1f)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.BITCOUNT */
#define IFX_DSADC_CGCFG_BITCOUNT_OFF (16)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.BREV */
#define IFX_DSADC_CGCFG_BREV_OFF (2)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.CGMOD */
#define IFX_DSADC_CGCFG_CGMOD_OFF (0)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.DIVCG */
#define IFX_DSADC_CGCFG_DIVCG_OFF (4)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.RUN */
#define IFX_DSADC_CGCFG_RUN_OFF (15)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.SGNCG */
#define IFX_DSADC_CGCFG_SGNCG_OFF (30)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.SIGPOL */
#define IFX_DSADC_CGCFG_SIGPOL_OFF (3)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_DSADC_CGCFG_STEPCOUNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPD */
#define IFX_DSADC_CGCFG_STEPD_OFF (29)

/** \\brief  Length for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CGCFG_Bits.STEPS */
#define IFX_DSADC_CGCFG_STEPS_OFF (28)

/** \\brief  Length for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYL */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYL_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_BOUNDSEL_Bits.BOUNDARYU */
#define IFX_DSADC_CH_BOUNDSEL_BOUNDARYU_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDCAP */
#define IFX_DSADC_CH_CGSYNC_SDCAP_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDCOUNT */
#define IFX_DSADC_CH_CGSYNC_SDCOUNT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDNEG */
#define IFX_DSADC_CH_CGSYNC_SDNEG_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_CGSYNC_Bits.SDPOS */
#define IFX_DSADC_CH_CGSYNC_SDPOS_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.CSRC */
#define IFX_DSADC_CH_DICFG_CSRC_OFF (16)

