keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.DSRC */
#define IFX_DSADC_CH_DICFG_DSRC_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.DSWC */
#define IFX_DSADC_CH_DICFG_DSWC_OFF (7)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_DSADC_CH_DICFG_ITRMODE_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.SCWC */
#define IFX_DSADC_CH_DICFG_SCWC_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.STROBE */
#define IFX_DSADC_CH_DICFG_STROBE_OFF (20)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TRSEL */
#define IFX_DSADC_CH_DICFG_TRSEL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TRWC */
#define IFX_DSADC_CH_DICFG_TRWC_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_DSADC_CH_DICFG_TSTRMODE_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.AFSC */
#define IFX_DSADC_CH_FCFGA_AFSC_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFAC */
#define IFX_DSADC_CH_FCFGA_CFAC_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFADCNT */
#define IFX_DSADC_CH_FCFGA_CFADCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.CFADF */
#define IFX_DSADC_CH_FCFGA_CFADF_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.EGT */
#define IFX_DSADC_CH_FCFGA_EGT_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.ESEL */
#define IFX_DSADC_CH_FCFGA_ESEL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGA_Bits.SRGA */
#define IFX_DSADC_CH_FCFGA_SRGA_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFEN */
#define IFX_DSADC_CH_FCFGC_CFEN_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMC */
#define IFX_DSADC_CH_FCFGC_CFMC_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMDCNT */
#define IFX_DSADC_CH_FCFGC_CFMDCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMDF */
#define IFX_DSADC_CH_FCFGC_CFMDF_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.CFMSV */
#define IFX_DSADC_CH_FCFGC_CFMSV_OFF (16)

