keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.MFSC */
#define IFX_DSADC_CH_FCFGC_MFSC_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGC_Bits.SRGM */
#define IFX_DSADC_CH_FCFGC_SRGM_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.DSH */
#define IFX_DSADC_CH_FCFGM_DSH_OFF (3)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_DSADC_CH_FCFGM_FIR0EN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_DSADC_CH_FCFGM_FIR0EN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_DSADC_CH_FCFGM_FIR0EN_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_DSADC_CH_FCFGM_FIR1EN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_DSADC_CH_FCFGM_FIR1EN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_DSADC_CH_FCFGM_FIR1EN_OFF (1)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_OFF (5)

/** \\brief  Length for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_OFF (2)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_OFF (7)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_OFF (23)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_OFF (29)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_OFF (4)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_OFF (28)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_OFF (2)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_LEN (1)

