keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_OFF (26)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_OFF (30)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_OFF (4)

/** \\brief  Length for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_OFF (30)

