keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC9 */
#define IFX_DSADC_EVFLAGCLR_RESEC9_OFF (9)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_OFF (13)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM6 */
#define IFX_DSADC_GLOBCFG_IRM6_OFF (14)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM8 */
#define IFX_DSADC_GLOBCFG_IRM8_OFF (15)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_OFF (1)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_OFF (2)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_OFF (3)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_OFF (5)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH6RUN */
#define IFX_DSADC_GLOBRC_CH6RUN_OFF (6)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH7RUN */
#define IFX_DSADC_GLOBRC_CH7RUN_OFF (7)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH8RUN */
#define IFX_DSADC_GLOBRC_CH8RUN_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_MSK (0x1)

