keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH9RUN */
#define IFX_DSADC_GLOBRC_CH9RUN_OFF (9)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_OFF (18)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_OFF (19)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_OFF (21)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M6RUN */
#define IFX_DSADC_GLOBRC_M6RUN_OFF (22)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M7RUN */
#define IFX_DSADC_GLOBRC_M7RUN_OFF (23)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M8RUN */
#define IFX_DSADC_GLOBRC_M8RUN_OFF (24)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.M9RUN */
#define IFX_DSADC_GLOBRC_M9RUN_OFF (25)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_OFF (21)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_OFF (28)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_OFF (29)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_OFF (30)

