keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_OFF (31)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_OFF (24)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_OFF (25)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_OFF (26)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_OFF (27)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC0_OFF (20)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN6NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6NVC1_OFF (21)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC0_OFF (16)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN6PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN6PVC1_OFF (17)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC0_OFF (28)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN7NVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7NVC1_OFF (29)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC0_OFF (24)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN7PVC1 */
#define IFX_DSADC_GLOBVCMH1_IN7PVC1_OFF (25)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC0_OFF (4)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN8NVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8NVC1_OFF (5)

