keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_bf.h
/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC0_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC1_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC1_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN8PVC1 */
#define IFX_DSADC_GLOBVCMH2_IN8PVC1_OFF (1)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN9NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9NVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN9NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9NVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN9NVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9NVC0_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.IN9PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9PVC0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.IN9PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9PVC0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.IN9PVC0 */
#define IFX_DSADC_GLOBVCMH2_IN9PVC0_OFF (8)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_LEN (2)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_OFF (30)

/** \\brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_OFF (29)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_OFF (29)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_BF_H */
